import { Breadcrumb, Col, Row, Typography } from "antd"

function ArticleDetail (props) {
    return (
        <div>
            <Breadcrumb>
                <Breadcrumb.Item>
                    <a href="/">Нүүр</a>
                </Breadcrumb.Item>
                <Breadcrumb.Item>
                    <a href="/articles">Нийтлэл</a>
                </Breadcrumb.Item>
                <Breadcrumb.Item>
                    Нийтлэл 1
                </Breadcrumb.Item>
            </Breadcrumb>      
            <Row gutter={[24, 24]} style={{ marginTop: '24px' }}>
                <Col xs={24} sm={24} md={24} lg={16}>
                    <div style={{ padding: '24px 40px', background: '#fff' }}>
                        <img alt="img" src="https://api.giga.mn/api/image/608d78afdbffea4f67b11a22/large" style={{ width: '100%', height: 'auto', objectFit: 'scale-down' }} />
                        <Typography.Title level={1}>"Nomadland" киноны сэтгэгдэл</Typography.Title>
                        <Typography.Paragraph style={{ fontSize: '16px' }}>
                            Oscar 2021-т нэр дэвшиж ялалт байгуулсан энэхүү киноны нэрийг ихэнх хүмүүс андахгүй биз. Киноны товч агуулга нь Америкийн эдийн засгийн хямралын үеэр бүх зүйлээ алдсан 60 гаруй настай эмэгтэй машинтайгаа ганцаараа аялалд гарна. Бүхээгт тэргэнд өдөр хоногоо өнгөрөөж, аяллын турш шинэ хүмүүстэй танилцан,  нүүдэлчдийн амьдралыг санагдуулж буй мэт. Энэ эмэгтэйн нөхөр нь нас барсан ба шинэ газруудад богино хугацаатай нүүдэллэж, ажил хийж, машиндаа хоноглодог тухай гарна.
                            <br />
                            <br />
                            Энэхүү киноны зураг авалт нь байгаль дэлхийн холбоо хамаарлыг маш сайн гаргасан, ихэвчлэн бүрхэг өдөр зураг авалтаа хийсэн юм шиг санагдсан. Над шиг бүрхэг өдөрт дуртай хүнд тохирсон намуухан, аятайхан орчинтой байсан. Киноны турш явагдах хөгжим ая нь энгийн дөлгөөхөн, уянгалаг, чихэнд чийртэй биш байсан учраас цааш үзэхэд хүргэсэн билээ. Nomadland бага зэрэг уйтгартай, өрнөлгүй болохоор кино шүүмжинд их өртсөн ч гэсэн дуртайяа үзсэн үзэгчдийн тоо олон.
                            <br />
                            <br />
                            Сонирхуулахад кино найруулагч нь Хятад эмэгтэй бөгөөд Ази гэхээсээ илүү Америк соёлыг гаргасан. Энэ киног үзэж байхад надад  нүдэнд туссан хэсгүүд бол "Амьдрах боломж байгаа дээр амьдар", "Дурсагддаг зүйлс л амьдардаг", "Гашуудал хагацал хүн бүрт байдаг. Давж чаддаггүй олон хүн бий", "Дотны хүн чинь чиний сэтгэл зүрхээс явахад хар нүх үлддэг" юм. Ерөнхийдөө дэлхийн хаа нэгтээ нүүдэллэж ажил хийдэг хүмүүс байж л байгаа. Нүүдэлчдийн амьдралд дуртай, аялах сонирхолтой хүмүүст зориулсан кино юм шиг санагдлаа. Энгийн ойлгомжгүй кино юм шиг мөртлөө асар гүн гүнзгий утгатай кино байлаа.
                        </Typography.Paragraph>
                        <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center' }}>
                            <div>LIKE</div>
                            <div style={{ fontStyle: 'italic' }}>2021 оны 5 сарын 17</div>
                        </div>
                    </div>
                </Col>
                <Col xs={24} sm={24} md={24} lg={8}>
                    <div className="container">
                        <Typography.Title level={5}>Нийтлэсэн</Typography.Title>
                        
                    </div>
                </Col>
            </Row>
        </div>
    )
}

export default ArticleDetail